The Id of the symbol associated with the node.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ElementId GetSymbolId()
  Visual Basic
Public Function GetSymbolId As ElementId
  Visual C++
public:
ElementId^ GetSymbolId()
 See Also
  GroupNode Class
  Autodesk.Revit.DB Namespace